//1051. 复数乘法 (15)
//
//时间限制
//400 ms
//内存限制
//65536 kB
//代码长度限制
//8000 B
//判题程序
//Standard
//作者
//CHEN, Yue

//复数可以写成(A + Bi)的常规形式，其中A是实部，B是虚部，i是虚数单位，满足i2 = -1；也可以写成极坐标下的指数形式(R*e(Pi))，其中R是复数模，P是辐角，i是虚数单位，其等价于三角形式 R(cos(P) + isin(P))。
//
//现给定两个复数的R和P，要求输出两数乘积的常规形式。
//
//输入格式：
//
//输入在一行中依次给出两个复数的R1, P1, R2, P2，数字间以空格分隔。
//
//输出格式：
//
//在一行中按照“A+Bi”的格式输出两数乘积的常规形式，实部和虚部均保留2位小数。注意：如果B是负数，则应该写成“A-|B|i”的形式。
//
//输入样例：
//2.3 3.5 5.2 0.4
//输出样例：
//-8.68-8.23i

//idea:
//这里学过复数的话应该知道
//(R1*e(P1i))*(R2*e(P2i))=(R1*r2*e((P1+p2)i))
//这题要额外注意一下C++的四舍五入是保留符号，将数字部分四舍五入

#include <iostream>
#include <cmath>
#include <cstdio>

using namespace std;

int main()
{
	double r1, p1, r2, p2;
	cin >> r1 >> p1 >> r2 >> p2;

	double a, b;
	a = r1*r2*cos(p1 + p2);
	b = r1*r2*sin(p1 + p2);

	//这题目过分了啊
	//-0.0049这样的数应该输出+0.00而不是-0.00
	if (a > 0)
		printf("%.2lf", a);
	else if (a <= 0 && a > -0.005)
		printf("0.00");
	else
		printf("%.2lf", a);

	if (b > 0)
		printf("+%.2lfi", b);
	else if (b <= 0 && b > -0.005)
		printf("+0.00i");
	else
		printf("%.2lfi", b);

	//去符号四舍五入后再添上符号
	//printf("\n%.2lf", -0.0049);
	//printf("\n%.2lf", -0.005);
}